


softwire                                                     R. Maglione
Internet-Draft                                            Telecom Italia
Intended status: Standards Track                               A. Durand
Expires: January 26, 2012                               Juniper Networks
                                                           July 25, 2011


                 RADIUS Extensions for Dual-Stack Lite
                draft-ietf-softwire-dslite-radius-ext-03

Abstract

   Dual-Stack Lite is a solution to offer both IPv4 and IPv6
   connectivity to customers which are addressed only with an IPv6
   prefix.  DS-Lite requires to pre-configure the DS-Lite Address Family
   Transition Router tunnel information on the Basic Bridging BroadBand
   element.  In many networks, the customer profile information may be
   stored in AAA servers while client configurations are mainly provided
   through DHC protocol.  This document specifies a new RADIUS attribute
   to carry Dual-Stack Lite Address Family Transition Router Tunnel
   name; the RADIUS attribute is defined based on the equivalent DHCPv6
   OPTION_AFTR_NAME option.  This RADIUS attribute is meant to be used
   between the RADIUS Server and the NAS, it is not intended to be used
   directly between the B4 element and the RADIUS Server.

Status of this Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at http://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on January 26, 2012.

Copyright Notice

   Copyright (c) 2011 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal



Maglione & Durand       Expires January 26, 2012                [Page 1]

Internet-Draft          DS-Lite RADIUS Extensions              July 2011


   Provisions Relating to IETF Documents
   (http://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

   This document may contain material from IETF Documents or IETF
   Contributions published or made publicly available before November
   10, 2008.  The person(s) controlling the copyright in some of this
   material may not have granted the IETF Trust the right to allow
   modifications of such material outside the IETF Standards Process.
   Without obtaining an adequate license from the person(s) controlling
   the copyright in such materials, this document may not be modified
   outside the IETF Standards Process, and derivative works of it may
   not be created outside the IETF Standards Process, except to format
   it for publication as an RFC or to translate it into languages other
   than English.































Maglione & Durand       Expires January 26, 2012                [Page 2]

Internet-Draft          DS-Lite RADIUS Extensions              July 2011


Table of Contents

   1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  4
   2.  Terminology  . . . . . . . . . . . . . . . . . . . . . . . . .  4
   3.  DS-Lite Configuration with RADIUS and DHCPv6 . . . . . . . . .  5
   4.  RADIUS Attribute . . . . . . . . . . . . . . . . . . . . . . .  7
     4.1.  DS-Lite-Tunnel-Name  . . . . . . . . . . . . . . . . . . .  8
   5.  Table of attributes  . . . . . . . . . . . . . . . . . . . . .  9
   6.  Security Considerations  . . . . . . . . . . . . . . . . . . .  9
   7.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . . 10
   8.  References . . . . . . . . . . . . . . . . . . . . . . . . . . 10
     8.1.  Normative References . . . . . . . . . . . . . . . . . . . 10
     8.2.  Informative References . . . . . . . . . . . . . . . . . . 10
   Authors' Addresses . . . . . . . . . . . . . . . . . . . . . . . . 10





































Maglione & Durand       Expires January 26, 2012                [Page 3]

Internet-Draft          DS-Lite RADIUS Extensions              July 2011


1.  Introduction

   Dual-Stack Lite [I-D.ietf-softwire-dual-stack-lite] is a solution to
   offer both IPv4 and IPv6 connectivity to customers which are
   addressed only with an IPv6 prefix (no IPv4 address is assigned to
   the attachment device).  One of its key components is an IPv4-over-
   IPv6 tunnel, but a DS-Lite Basic Bridging BroadBand (B4) will not
   know if the network it is attached to offers Dual-Stack Lite support,
   and if it did, would not know the remote end of the tunnel to
   establish a connection.

   To inform the B4 of the AFTR's location, a Fully Qualified Domain
   Name (FQDN) may be used.  Once this information is conveyed, the
   presence of the configuration indicating the AFTR's location also
   informs a host to initiate Dual-Stack Lite (DS-Lite) service and
   become a Softwire Initiator.

   [I-D.ietf-softwire-ds-lite-tunnel-option] specifies a DHCPv6 option
   which is meant to be used by a Dual-Stack Lite client (Basic Bridging
   BroadBand element, B4) to discover its Address Family Transition
   Router (AFTR) name.  In order to be able to populate such option the
   DHCPv6 Server must be pre-provisioned with the Address Family
   Transition Router (AFTR) name.

   In Broadband environments, customer profile may be managed by AAA
   servers, together with user Authentication, Authorization, and
   Accounting (AAA).  RADIUS protocol [RFC2865] is usually used by AAA
   Servers to communicate with network elements.
   [I-D.ietf-radext-ipv6-access] describes a typical broadband network
   scenario in which the Network Access Server (NAS) acts as the access
   gateway for the users (hosts or CPEs) and the NAS embeds a DHCPv6
   Server function that allows it to locally handle any DHCPv6 requests
   issued by the clients.

   Since the DS-Lite AFTR information can be stored in AAA servers and
   the client configuration is mainly provided through DHC protocol
   running between the NAS and the requesting clients, a new RADIUS
   attribute is needed to send AFTR information from AAA server to the
   NAS.

   This document aims at defining a new RADIUS attribute to be used for
   carrying the DS-Lite Tunnel Name, based on the equivalent DHCPv6
   option already specified in [I-D.ietf-softwire-ds-lite-tunnel-option]


2.  Terminology

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",



Maglione & Durand       Expires January 26, 2012                [Page 4]

Internet-Draft          DS-Lite RADIUS Extensions              July 2011


   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in [RFC2119].

   The terms DS-Lite Basic Bridging BroadBand element (B4) and the DS-
   Lite Address Family Transition Router element (AFTR) are defined in
   [I-D.ietf-softwire-dual-stack-lite]


3.  DS-Lite Configuration with RADIUS and DHCPv6

   The Figure 1 illustrates how the RADIUS protocol and DHCPv6 work
   together to accomplish DS-Lite configuration on the B4 element when a
   PPP Session is used to provide connectivity to the user.

   The Network Access Server (NAS) operates as a client of RADIUS and as
   DHCP Server for DHC protocol.  The NAS initially sends a RADIUS
   Access Request message to the RADIUS server, requesting
   authentication.  Once the RADIUS server receives the request, it
   validates the sending client and if the request is approved, the AAA
   server replies with an Access Accept message including a list of
   attribute-value pairs that describe the parameters to be used for
   this session.  This list may also contain the AFTR Tunnel Name.  When
   the NAS receives a DHCPv6 client request containing the DS-Lite
   tunnel Option, the NAS shall use the name returned in the RADIUS DS-
   Lite-Tunnel-Name attribute to populate the DHCPv6 OPTION_AFTR_NAME
   option in the DHCPv6 reply message.

























Maglione & Durand       Expires January 26, 2012                [Page 5]

Internet-Draft          DS-Lite RADIUS Extensions              July 2011


       B4                                NAS                     AAA
       |                                  |                     Server
       |                                  |                        |
       |----PPP LCP Config Request------> |                        |
       |                                  |                        |
       |                                  |----Access-Request ---->|
       |                                  |                        |
       |                                  |<---- Access-Accept-----|
       |                                  | (DS-Lite-Tunnel-Name)  |
       |<-----PPP LCP Config ACK  -----   |                        |
       |                                  |                        |
       |                                  |                        |
       |------ PPP IPv6CP Config Req ---->|                        |
       |                                  |                        |
       |<----- PPP IPv6CP Config ACK -----|                        |
       |                                  |                        |
       |-------  DHCPv6 Solicit  -------->|                        |
       |                                  |                        |
       |<-------DHCPv6 Advertisement -----|                        |
       |   (DHCPv6 OPTION_AFTR_NAME)   |                        |
       |                                  |                        |
       |-------  DHCPv6 Request  -------->|                        |
       |                                  |                        |
       |<-------- DHCPv6 Reply ---------  |                        |
       |   (DHCPv6 OPTION_AFTR_NAME)   |                        |

                   DHCPv6                         RADIUS

        Figure 1: RADIUS and DHCPv6 Message Flow for a PPP Session

   The Figure 2 illustrates how the RADIUS protocol and DHCPv6 work
   together to accomplish DS-Lite configuration on the B4 element when
   an IP Session is used to provide connectivity to the user.

   The only difference between this message flow and previous one is
   that in this scenario the interaction between NAS and AAA/ RADIUS
   Server is triggered by the DHCPv6 Solicit message received by the NAS
   from the B4 acting as DHCPv6 client, while in case of a PPP Session
   the trigger is the PPP LCP Config Request message received by the
   NAS.











Maglione & Durand       Expires January 26, 2012                [Page 6]

Internet-Draft          DS-Lite RADIUS Extensions              July 2011


       B4                                NAS                      AAA
       |                                  |                      Server
       |------ DHCPv6 Solicit --------->  |                        |
       |                                  |                        |
       |                                  |----Access-Request ---->|
       |                                  |                        |
       |                                  |<-Access-Accept---------|
       |                                  | (DS-Lite-Tunnel-Name)  |
       |                                  |                        |
       |<-------DHCPv6 Advertisement------|                        |
       |  (DHCPv6 OPTION_AFTR_NAME)    |                        |
       |                                  |                        |
       |-------  DHCPv6 Request  -------->|                        |
       |                                  |                        |
       |                                  |                        |
       | <---- DHCPv6 Reply ----          |                        |
       |  (DHCPv6 OPTION_AFTR_NAME)    |                        |

                   DHCPv6                         RADIUS

        Figure 2: RADIUS and DHCPv6 Message Flow for an IP Session

   After receiving the DS-Lite-Tunnel-Name in the initial Access-Accept
   the NAS MUST store the received AFTR Tunnel Name locally.  When the
   B4 sends a DHCPv6 Renew message to request an extension of the
   lifetimes for the assigned address or prefix, the NAS does not have
   to initiate a new Access-Request towards the AAA server to request
   the AFTR tunnel name.  The NAS retrieves the previously stored AFTR
   tunnel name and uses it in its reply.

   According to [RFC3315] if the DHCPv6 server to which the DHCPv6 Renew
   message was sent at time T1 has not responded, the DHCPv6 client
   initiates a Rebind/Reply message exchange with any available server.
   In this scenario the NAS receiving the DHCPv6 rebind message MUST
   initiate a new Access-Request towards the AAA server.  The NAS MAY
   include the DS-Lite-Tunnel-Name attribute in its Access-Request.

   If the NAS does not receive the DS-Lite-Tunnel-Name attribute in the
   Access-Accept it MAY fallback to a pre-configured default tunnel
   name, if any.  If the NAS does not have any pre-configured default
   tunnel name or if the NAS receives an Access-Reject, the tunnel
   cannot be established and NAS MUST terminate the session towards the
   B4.


4.  RADIUS Attribute

   This section specifies the format of the new RADIUS attribute.



Maglione & Durand       Expires January 26, 2012                [Page 7]

Internet-Draft          DS-Lite RADIUS Extensions              July 2011


4.1.   DS-Lite-Tunnel-Name

   Description

   The DS-Lite-Tunnel-Name RADIUS attribute contains a Fully Qualified
   Domain Name that refers to the AFTR the client is requested to
   establish a connection with.  The NAS SHALL use the name returned in
   the RADIUS DS-Lite-Tunnel-Name attribute to populate the DHCPv6
   OPTION_AFTR_NAME option [I-D.ietf-softwire-ds-lite-tunnel-option]

   This attribute MAY be used in Access-Accept packets as a hint to the
   RADIUS server; for example if the NAS is pre-configured with a
   default tunnel name, this name MAY be inserted in the attribute.  The
   RADIUS server MAY ignore the hint sent by the NAS and it MAY assign a
   different AFTR tunnel name.

   If the NAS includes the DS-Lite-Tunnel-Name attribute, but the AAA
   server does not recognize it, this attribute MUST be ignored by the
   AAA Server.

   If the NAS does not receive DS-Lite-Tunnel-Name attribute in the
   Access-Accept it MAY fallback to a pre-configured default tunnel
   name, if any.  If the NAS does not have any pre-configured default
   tunnel name, the tunnel can not be established.

   If the NAS is pre-provisioned with a default AFTR tunnel name and the
   AFTR tunnel name received in Access-Accept is different from the
   configured default, then the AFTR tunnel name received from the AAA
   server MUST overwrite the pre-configured default on the NAS.

   The DS-Lite-Tunnel-Name RADIUS attribute MAY be present in
   Accounting-Request records where the Acct-Status-Type is set to
   Start, Stop or Interim-Update.  The DS-Lite-Tunnel-Name RADIUS
   attribute and MUST NOT appear more than once in a message.

   A summary of the DS-Lite-Tunnel-Name RADIUS attribute format is shown
   below.  The fields are transmitted from left to right.














Maglione & Durand       Expires January 26, 2012                [Page 8]

Internet-Draft          DS-Lite RADIUS Extensions              July 2011


       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |     Type      |    Length     |  DS-Lite-Tunnel-Name (FQDN)   |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                DS-Lite-Tunnel-Name (FQDN) (cont)              |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   Type:

        TBA1 for DS-Lite-Tunnel-Name.
   Length:
        This field indicates the total length in octets of this
        attribute including the Type, the Length fields and the length
        in octets of the DS-Lite-Tunnel-Name field

   DS-Lite-Tunnel-Name:
        A single Fully Qualified Domain Name of the remote tunnel
        endpoint, located at the DS-Lite AFTR.


5.  Table of attributes

   The following table provides a guide to which attributes may be found
   in which kinds of packets, and in what quantity.

   Request Accept Reject Challenge Accounting   #    Attribute
                                   Request
   0-1     0-1    0      0         0-1          TBA1 DS-Lite-Tunnel-Name

   The following table defines the meaning of the above table entries.

   0   This attribute MUST NOT be present in packet.
   0+  Zero or more instances of this attribute MAY be present in
       packet.
   0-1 Zero or one instance of this attribute MAY be present in packet.

   The data type of DS-Lite-Tunnel-Name is a string.


6.  Security Considerations

   This document has no additional security considerations beyond those
   already identified in [RFC2865]

   [I-D.ietf-softwire-dual-stack-lite] discusses DS-Lite related
   security issues.




Maglione & Durand       Expires January 26, 2012                [Page 9]

Internet-Draft          DS-Lite RADIUS Extensions              July 2011


7.  IANA Considerations

   This document requests the allocation of a new Radius attribute types
   from the IANA registry "Radius Attribute Types" located at
   http://www.iana.org/assignments/radius-types

      DS-Lite-Tunnel-Name - TBA1


8.  References

8.1.  Normative References

   [I-D.ietf-softwire-ds-lite-tunnel-option]
              Hankins, D. and T. Mrugalski, "Dynamic Host Configuration
              Protocol for IPv6 (DHCPv6) Option for Dual- Stack Lite",
              draft-ietf-softwire-ds-lite-tunnel-option-10 (work in
              progress), March 2011.

   [I-D.ietf-softwire-dual-stack-lite]
              Durand, A., Droms, R., Woodyatt, J., and Y. Lee, "Dual-
              Stack Lite Broadband Deployments Following IPv4
              Exhaustion", draft-ietf-softwire-dual-stack-lite-11 (work
              in progress), May 2011.

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119, March 1997.

   [RFC2865]  Rigney, C., Willens, S., Rubens, A., and W. Simpson,
              "Remote Authentication Dial In User Service (RADIUS)",
              RFC 2865, June 2000.

   [RFC3315]  Droms, R., Bound, J., Volz, B., Lemon, T., Perkins, C.,
              and M. Carney, "Dynamic Host Configuration Protocol for
              IPv6 (DHCPv6)", RFC 3315, July 2003.

8.2.  Informative References

   [I-D.ietf-radext-ipv6-access]
              Lourdelet, B., Dec, W., Sarikaya, B., Zorn, G., and D.
              Miles, "RADIUS attributes for IPv6 Access Networks",
              draft-ietf-radext-ipv6-access-05 (work in progress),
              July 2011.








Maglione & Durand       Expires January 26, 2012               [Page 10]

Internet-Draft          DS-Lite RADIUS Extensions              July 2011


Authors' Addresses

   Roberta Maglione
   Telecom Italia
   Via Reiss Romoli 274
   Torino  10148
   Italy

   Phone:
   Email: roberta.maglione@telecomitalia.it


   Alain Durand
   Juniper Networks
   1194 North Mathilda Avenue
   Sunnyvale, CA  94089-1206
   USA

   Phone:
   Fax:
   Email: adurand@juniper.net
   URI:





























Maglione & Durand       Expires January 26, 2012               [Page 11]

